# ABC108 A - A - Pair 

 [問題リンク](https://atcoder.jp/contests/abc108/tasks/abc108_a)
 配点：100点  
 実行時間制限：2 sec / メモリ制限：1024 MiB

---

## 問題文

1 以上 
K 以下の正の整数から、偶数と奇数ひとつずつの組を選ぶ方法の個数を求めてください。なお、選ぶ順番は考慮しません。

制約
2≤K≤100
K は整数である
入力は以下の形式で標準入力から与えられる。
K
出力
1 以上 K 以下の正の整数から、偶数と奇数ひとつずつの組を選ぶ方法の個数を出力せよ。
---

## 解法

- /2をして余りが出るか出ないかで分ける
- 余りが出ない場合は商を二乗すれば良い
- 余りが出た場合は、商を二乗、商＊余りの和が組み合わせとなる
---

## 自己分析

- 累乗は**で表せる
- //で小数点以下切り捨ての値が得られる
- 
---

## 入力例
K = int(input())

A = K // 2
B = K % 2
if K % 2 == 0:
    print(A**2)
else:
    print(A**2 + A*B)
    
